vegeta_stress_testing/vegeta_testing_cache_get_all.txt
# GET localhost:8080/cache/orders

Requests      [total, rate, throughput]         3000, 50.02, 50.02
Duration      [total, attack, wait]             59.981s, 59.98s, 829.126µs
Latencies     [min, mean, 50, 90, 95, 99, max]  470.896µs, 838.02µs, 835.852µs, 980.35µs, 1.043ms, 1.378ms, 3.614ms
Bytes In      [total, mean]                     25358005, 8452.67
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set: