vegeta_stress_testing/vegeta_testing_cache_get_one.txt
# GET localhost:8080/cache/orders/b563feb7b2b84b6test2

Requests      [total, rate, throughput]         3000, 50.02, 50.02
Duration      [total, attack, wait]             59.98s, 59.98s, 391.323µs
Latencies     [min, mean, 50, 90, 95, 99, max]  175.162µs, 435.084µs, 427.037µs, 515.51µs, 540.767µs, 655.803µs, 3.462ms
Bytes In      [total, mean]                     3114000, 1038.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set: