vegeta_stress_testing/vegeta_testing_db_get_one.txt
# GET localhost:8080/db/orders/b563feb7b2b84b6test2

Requests      [total, rate, throughput]         3000, 50.02, 50.02
Duration      [total, attack, wait]             59.981s, 59.98s, 1.308ms
Latencies     [min, mean, 50, 90, 95, 99, max]  729.753µs, 1.083ms, 1.048ms, 1.341ms, 1.434ms, 1.663ms, 2.893ms
Bytes In      [total, mean]                     3114000, 1038.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set: